{
  "_name_or_path": "mukund/privbert",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Data Retention",
    "1": "Data Security",
    "2": "Do Not Track",
    "3": "First Party Collection/Use",
    "4": "International and Specific Audiences",
    "5": "Introductory/Generic",
    "6": "Policy Change",
    "7": "Practice not covered",
    "8": "Privacy contact information",
    "9": "Third Party Sharing/Collection",
    "10": "User Access, Edit and Deletion",
    "11": "User Choice/Control"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Data Retention": 0,
    "Data Security": 1,
    "Do Not Track": 2,
    "First Party Collection/Use": 3,
    "International and Specific Audiences": 4,
    "Introductory/Generic": 5,
    "Policy Change": 6,
    "Practice not covered": 7,
    "Privacy contact information": 8,
    "Third Party Sharing/Collection": 9,
    "User Access, Edit and Deletion": 10,
    "User Choice/Control": 11
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.24.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
